tap "adoptopenjdk/openjdk"
tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/services"
# Core application library for C
brew "glib"
# Manage compile and link flags for libraries
brew "pkg-config"
# Java build tool
brew "ant"
# Text processor and publishing toolchain for AsciiDoc
brew "asciidoctor"
# Shell extension to jump to frequently used directories
brew "autojump"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Image manipulation library
brew "jpeg", link: true
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Bare libuv bindings for lua
brew "luv"
# Java-based project management
brew "maven"
# Open source relational database management system
brew "mysql"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Utility for managing network connections
brew "netcat"
# Platform built on V8 to build network applications
brew "node@16"
# Cross-shell prompt for astronauts
brew "starship"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Java IDE by JetBrains
cask "intellij-idea"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Open-source Markdown editor
cask "macdown"
# Collaboration platform for API development
cask "postman"
# Multiplayer code editor
cask "zed"
# Web Browser
cask "firefox"
